In [ ]:
# importing the necessary libraries
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [ ]:
# for xtrain and x test splitting
from sklearn.model_selection import train_test_split

# for scaling
from sklearn.preprocessing import StandardScaler, OneHotEncoder

# for feature selection
from sklearn.feature_selection import SelectKBest, f_classif

# for column transformation
from sklearn.compose import ColumnTransformer

#pipeline
from sklearn.pipeline import Pipeline

In [ ]:
# Simple encoding
# 1. Label Encoder
# 2. One hot encoder

# creating a dataframe
data = {'Category':['A','B','C','D','A','B','D','C','C']}
# CONVERTING this dictionary to DataFrame

df = pd.DataFrame(data)
df

  Category
0        A
1        B
2        C
3        D
4        A
5        B
6        D
7        C
8        C

In [ ]:
# label Encoding
# import library

from sklearn.preprocessing import LabelEncoder

In [ ]:
l_e = LabelEncoder()

df['encoded_category'] = l_e.fit_transform(df['Category'])
df

  Category  encoded_category
0        A                 0
1        B                 1
2        C                 2
3        D                 3
4        A                 0
5        B                 1
6        D                 3
7        C                 2
8        C                 2

In [ ]:
# Manual encoding
m_ec = {'A':10,'B':20,'C':30,"D":40}
df['m_enc_cat'] = df['Category'].map(m_ec)
df

  Category  encoded_category  m_enc_cat
0        A                 0         10
1        B                 1         20
2        C                 2         30
3        D                 3         40
4        A                 0         10
5        B                 1         20
6        D                 3         40
7        C                 2         30
8        C                 2         30

In [ ]:
# One Hot Encoding
o_enc = OneHotEncoder(sparse_output = False)
o_h_Variable = o_enc.fit_transform(df[['Category']])

In [ ]:
# to get the dataframe back
one_hot_df = pd.DataFrame(o_h_Variable, columns = [f'Category_{i}' for i in l_e.classes_])
df = pd.concat([df, one_hot_df], axis = 1)
df

,Category,encoded_category,m_enc_cat,Category_A,Category_B,Category_C,Category_D
0,A,0,10,1.0,0.0,0.0,0.0
1,B,1,20,0.0,1.0,0.0,0.0
2,C,2,30,0.0,0.0,1.0,0.0
3,D,3,40,0.0,0.0,0.0,1.0
4,A,0,10,1.0,0.0,0.0,0.0
5,B,1,20,0.0,1.0,0.0,0.0
6,D,3,40,0.0,0.0,0.0,1.0
7,C,2,30,0.0,0.0,1.0,0.0
8,C,2,30,0.0,0.0,1.0,0.0

In [ ]:
# One hot encoding using get dummies
df_get_dummies = pd.get_dummies(df['Category'], prefix = "Category")

In [ ]:
df1 = pd.concat([df,df_get_dummies],axis = 1)
df1

,Category,encoded_category,m_enc_cat,Category_A,Category_B,Category_C,Category_D,Category_A,Category_B,Category_C,Category_D
0,A,0,10,1.0,0.0,0.0,0.0,True,False,False,False
1,B,1,20,0.0,1.0,0.0,0.0,False,True,False,False
2,C,2,30,0.0,0.0,1.0,0.0,False,False,True,False
3,D,3,40,0.0,0.0,0.0,1.0,False,False,False,True
4,A,0,10,1.0,0.0,0.0,0.0,True,False,False,False
5,B,1,20,0.0,1.0,0.0,0.0,False,True,False,False
6,D,3,40,0.0,0.0,0.0,1.0,False,False,False,True
7,C,2,30,0.0,0.0,1.0,0.0,False,False,True,False
8,C,2,30,0.0,0.0,1.0,0.0,False,False,True,False

In [ ]:
# loading the titanic dataset
df = pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [ ]:
# Checking for null values
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# Dropping unnecessary columns
df.drop(columns = ['PassengerId','Name','Ticket','Cabin'], inplace = True)
df

     Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0           0       3    male  22.0      1      0   7.2500        S
1           1       1  female  38.0      1      0  71.2833        C
2           1       3  female  26.0      0      0   7.9250        S
3           1       1  female  35.0      1      0  53.1000        S
4           0       3    male  35.0      0      0   8.0500        S
..        ...     ...     ...   ...    ...    ...      ...      ...
886         0       2    male  27.0      0      0  13.0000        S
887         1       1  female  19.0      0      0  30.0000        S
888         0       3  female   NaN      1      2  23.4500        S
889         1       1    male  26.0      0      0  30.0000        C
890         0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [ ]:
df.isnull().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Fare          0
Embarked      2
dtype: int64

In [ ]:
# for demonstartion only
# handling missing values
df['Age'].fillna(df['Age'].median(),inplace = True) #fill with median approach

df['Embarked'].fillna(df['Embarked'].mode()[0],inplace = True) # mode approach

C:\Users\ANWAR RAJEEV\AppData\Local\Temp\ipykernel_24360\285343069.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Age'].fillna(df['Age'].median(),inplace = True) #fill with median approach
C:\Users\ANWAR RAJEEV\AppData\Local\Temp\ipykernel_24360\285343069.py:5: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Embarked'].fillna(df['Embarked'].mode()[0],inplace = True) # mode approach

In [ ]:
df.isnull().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Fare        0
Embarked    0
dtype: int64

In [ ]:
df.head()

   Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0         0       3    male  22.0      1      0   7.2500        S
1         1       1  female  38.0      1      0  71.2833        C
2         1       3  female  26.0      0      0   7.9250        S
3         1       1  female  35.0      1      0  53.1000        S
4         0       3    male  35.0      0      0   8.0500        S

In [ ]:
# classfying the variables
categorical_features = ['Sex','Embarked']

In [ ]:
df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [ ]:
ohe = OneHotEncoder(drop = 'first',sparse_output=False)
scaler = StandardScaler()

In [ ]:
# Splitting the dataset to X and y
X = df.drop(columns = ['Survived'])
y = df['Survived']

In [ ]:
X.head()

   Pclass     Sex   Age  SibSp  Parch     Fare Embarked
0       3    male  22.0      1      0   7.2500        S
1       1  female  38.0      1      0  71.2833        C
2       3  female  26.0      0      0   7.9250        S
3       1  female  35.0      1      0  53.1000        S
4       3    male  35.0      0      0   8.0500        S

In [ ]:
y.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [ ]:
# Splitting to train and test using train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,y,test_size = 0.2, random_state = 42)

In [ ]:
X.shape

(891, 7)

In [ ]:
X_train.shape

(712, 7)

In [ ]:
X_train.head()

     Pclass     Sex   Age  SibSp  Parch     Fare Embarked
331       1    male  45.5      0      0  28.5000        S
733       2    male  23.0      0      0  13.0000        S
382       3    male  32.0      0      0   7.9250        S
704       3    male  26.0      1      0   7.8542        S
813       3  female   6.0      4      2  31.2750        S

In [ ]:
numerical_features = ['Pclass','Age','SibSp','Parch']

In [ ]:
categorical_features

['Sex', 'Embarked']

In [ ]:
numerical_features

['Pclass', 'Age', 'SibSp', 'Parch']

In [ ]:
# use fit_transform for train data and
# transform for test data

# one hot encoding
X_train_cat = X_train[categorical_features]

X_test_cat = X_test[categorical_features]

In [ ]:
# processing numerical variables separately
X_train_num = X_train[numerical_features]
X_test_num = X_test[numerical_features]

In [ ]:
X_train_cat

        Sex Embarked
331    male        S
733    male        S
382    male        S
704    male        S
813  female        S
..      ...      ...
106  female        S
270    male        S
860    male        S
435  female        S
102    male        S

[712 rows x 2 columns]

In [ ]:
# Scaling
# only for X
X_train_num_scaled = scaler.fit_transform(X_train_num)
X_test_num_scaled = scaler.transform(X_test_num)

In [ ]:
# One hot encoding of categorical features

In [ ]:
X_train_cat_encoded = ohe.fit_transform(X_train_cat)
X_test_cat_encoded = ohe.transform(X_test_cat)

In [ ]:
X_train_cat_encoded

array([[1., 0., 1.],
       [1., 0., 1.],
       [1., 0., 1.],
       ...,
       [1., 0., 1.],
       [0., 0., 1.],
       [1., 0., 1.]])

In [ ]:
# just to understand
demo_features = ohe.get_feature_names_out(categorical_features)
X_train_view = pd.DataFrame(X_train_cat_encoded, columns = demo_features)
X_train_view.head()

   Sex_male  Embarked_Q  Embarked_S
0       1.0         0.0         1.0
1       1.0         0.0         1.0
2       1.0         0.0         1.0
3       1.0         0.0         1.0
4       0.0         0.0         1.0

In [ ]:
# feature selection
# ANOVA F-test for numerical features
anova_sel = SelectKBest(score_func = f_classif, k = 3)
X_train_num_selected = anova_sel.fit_transform(X_train_num_scaled, y_train)
X_test_num_selected = anova_sel.transform(X_test_num_scaled)

In [ ]:
X_test_num_selected.shape

(179, 3)

In [ ]:
# Chisquare for Categorical features
from sklearn.feature_selection import SelectKBest, f_classif, chi2

In [ ]:
chi2_sel = SelectKBest(score_func=chi2, k =2)
X_train_cat_selected = chi2_sel.fit_transform(X_train_cat_encoded, y_train)
X_test_cat_selected = chi2_sel.transform(X_test_cat_encoded)

In [ ]:
X_train_cat_selected.shape

(712, 2)

In [ ]:
X_test_cat_selected.shape

(179, 2)

In [ ]:
# Displaying the features
X_train_selected = np.hstack((X_train_num_selected, X_train_cat_selected))
X_test_selected = np.hstack((X_test_num_selected , X_test_cat_selected))

In [ ]:
X_test_selected.shape

(179, 5)

In [ ]:
X_train_selected.shape

(712, 5)

In [ ]:
# Combining the those feature which got selected
num_feature_names= numerical_features
cat_feature_names = list(ohe.get_feature_names_out(categorical_features))

In [ ]:
num_feature_names

['Pclass', 'Age', 'SibSp', 'Parch']

In [ ]:
cat_feature_names

['Sex_male', 'Embarked_Q', 'Embarked_S']

In [ ]:
# Getting the scores
num_score = pd.DataFrame({'Feature':num_feature_names, 'Score':anova_sel.scores_})
cat_score = pd.DataFrame({'Feature':cat_feature_names, 'Score':chi2_sel.scores_})

In [ ]:
num_score

  Feature      Score
0  Pclass  81.989322
1     Age   1.680118
2   SibSp   1.612462
3   Parch   4.381027

In [ ]:
feature_score = pd.concat([num_score,cat_score]).sort_values(by='Score',ascending=False)
feature_score.head()

      Feature      Score
0      Pclass  81.989322
0    Sex_male  71.905882
3       Parch   4.381027
2  Embarked_S   3.352800
1         Age   1.680118

In [ ]:
# get selected feature names
selected_num_features = [num_feature_names[i] for i in anova_sel.get_support(indices=True)]
selected_cat_features = [cat_feature_names[i] for i in chi2_sel.get_support(indices=True)]
selected_features = selected_num_features + selected_cat_features

In [ ]:
# the final dataframe
X_train_final = pd.DataFrame(X_train_selected, columns = selected_features)
X_test_final = pd.DataFrame(X_test_selected, columns = selected_features)

In [ ]:
X_test_final

       Pclass       Age     Parch  Sex_male  Embarked_S
0    0.813034 -0.092634  0.784700       1.0         0.0
1   -0.400551  0.138156 -0.479342       1.0         1.0
2    0.813034 -0.708074 -0.479342       1.0         1.0
3   -0.400551 -1.785093  0.784700       0.0         1.0
4    0.813034 -1.169653 -0.479342       0.0         0.0
..        ...       ...       ...       ...         ...
174  0.813034 -0.938863 -0.479342       1.0         1.0
175  0.813034 -0.092634 -0.479342       1.0         0.0
176  0.813034  0.676666  5.840867       0.0         1.0
177 -0.400551 -0.938863 -0.479342       0.0         1.0
178  0.813034 -1.938953  0.784700       0.0         1.0

[179 rows x 5 columns]